# StartParameter Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PolylineSegments..::..StartParameter Property
PolylineSegments Class See Also
---
Parameter associated with the start point.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public double StartParameter { get; }
```

Visual Basic
---
```text
Public ReadOnly Property StartParameter As Double
	Get
```

Visual C++
---
```text
public:
property double StartParameter {
	double get ();
}
```

# See Also
PolylineSegments Class
Autodesk.Revit.DB Namespace